In [1]:
import pandas as pd

In [2]:
toyota_sales = pd.read_csv("data/car_sales/toyota_sales_data.csv")

In [7]:
toyota_sales.groupby("car_model")["sale_amount"].describe()

,count,mean,std,min,25%,50%,75%,max
car_model,,,,,,,,
Camry,856.0,27470.874825,1430.891192,25006.17,26248.2500,27448.575,28679.1950,29981.84
Corolla,827.0,22442.176808,1460.472207,20000.94,21123.4350,22477.280,23723.8150,24996.35
Highlander,814.0,40002.871658,2912.373577,35008.84,37483.4900,39988.890,42514.5175,44975.88
RAV4,860.0,30985.724349,2356.255894,27002.66,28964.0375,30922.640,33016.2925,34965.01
Tacoma,826.0,34998.464068,2906.544809,30011.69,32421.8900,34989.815,37517.3625,39994.13
Tundra,817.0,42478.580428,4236.084042,35026.61,38943.1100,42306.670,46146.2900,49995.68

In [8]:
sales_reps = pd.read_csv("data/car_sales/sales_reps_data.csv")

In [12]:
# Merge to get region info
sales_with_region = toyota_sales.merge(
    sales_reps[['rep_id', 'region']], 
    left_on='sale_rep_id', 
    right_on='rep_id'
)

In [ ]:
sales_with_region.groupby("region")["sale_amount"].describe()

,count,mean,std,min,25%,50%,75%,max
region,,,,,,,,
East,986.0,32984.519118,7576.315037,20001.20,27346.225,32070.810,39016.1575,49974.88
North,2526.0,33038.378274,7344.735779,20003.27,27347.775,32889.685,38713.1200,49995.68
South,479.0,32863.790209,7533.823148,20106.29,27098.520,32320.140,38865.9150,49907.66
West,1009.0,32883.157770,7409.716683,20000.94,27100.000,32463.620,38627.6500,49810.29

In [15]:
sales_with_region.groupby("region")["sale_amount"].sum()

region
East     32522735.85
North    83454943.52
South    15741755.51
West     33179106.19
Name: sale_amount, dtype: float64

In [16]:
toyota_sales.groupby("sale_status")["sale_amount"].describe()

,count,mean,std,min,25%,50%,75%,max
sale_status,,,,,,,,
Cancelled,382.0,33048.315550,7262.912029,20139.53,27600.0275,32371.09,39175.095,49974.88
Completed,3543.0,33389.033201,7396.169136,20001.20,27704.1650,33198.04,39053.745,49979.12
Pending,1075.0,31606.269674,7397.291425,20000.94,25841.9400,29778.34,37433.800,49995.68

In [17]:
toyota_sales.groupby("car_model")[["sale_amount", "commission_pct"]].describe()

           sale_amount                                                   \
                 count          mean          std       min         25%
car_model
Camry            856.0  27470.874825  1430.891192  25006.17  26248.2500
Corolla          827.0  22442.176808  1460.472207  20000.94  21123.4350
Highlander       814.0  40002.871658  2912.373577  35008.84  37483.4900
RAV4             860.0  30985.724349  2356.255894  27002.66  28964.0375
Tacoma           826.0  34998.464068  2906.544809  30011.69  32421.8900
Tundra           817.0  42478.580428  4236.084042  35026.61  38943.1100

                                            commission_pct            \
                  50%         75%       max          count      mean
car_model
Camry       27448.575  28679.1950  29981.84          612.0  0.033497
Corolla     22477.280  23723.8150  24996.35          626.0  0.033786
Highlander  39988.890  42514.5175  44975.88          614.0  0.034316
RAV4        30922.640  33016.2925  34965.01          651.0  0.033118
Tacoma      34989.815  37517.3625  39994.13          625.0  0.033424
Tundra      42306.670  46146.2900  49995.68          598.0  0.034264


                 std   min   25%   50%   75%   max
car_model
Camry       0.012332  0.02  0.02  0.03  0.05  0.05
Corolla     0.012376  0.02  0.02  0.03  0.05  0.05
Highlander  0.012776  0.02  0.02  0.03  0.05  0.05
RAV4        0.012550  0.02  0.02  0.03  0.05  0.05
Tacoma      0.012562  0.02  0.02  0.03  0.05  0.05
Tundra      0.012416  0.02  0.02  0.03  0.05  0.05